#+STARTUP: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]
#+TITLE: lassopart
#+DATE: <2016-02-12 Fri>
#+AUTHOR: Nooreen S Dabbish
#+EMAIL: nooreen@noory
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: c:nil creator:comment d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t toc:t todo:t |:t
#+CREATOR: Emacs 24.4.1 (Org mode 8.2.10)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+BEAMER_FRAME_LEVEL: 2
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)


*** Selected \lambda s

#+BEGIN_SRC R :session cmatrix :results output :exports both :tangle yes
  cvfit$lambda.min
#+END_SRC

#+RESULTS:
: [1] 0.06681268

**** ~lambda.min~ value that gives minimum cross-validated error

#+BEGIN_SRC R :session cmatrix :results output :exports both :tangle yes
cvfit$lambda.1se
#+END_SRC

#+RESULTS:
: [1] 0.1015493

**** TODO ~lambda.1se~ value that gives most regularized model with error vwithin one standard error of minimum cross-validated error

#+BEGIN_SRC R :session cmatrix :results output :exports both :tangle yes
  b <- as.matrix(coef(cvfit, s= "lambda.1se"))
  rownames(b)[b!=0]
#+END_SRC

#+RESULTS:
:  [1] "(Intercept)"   "LFOC-LC"       "LMFG-LAG"      "RFOC2-RFOC"   
:  [5] "RFP3-RPG5"     "RCGad4-RPG4"   "RCOC2-RCOC"    "LIC3-RTP2"    
:  [9] "LPGpd-LPC"     "LPGpd-RTFCpd"  "RPG9-RTFCpd2"  "RFP6-LPG6"    
: [13] "LMFG3-LPG6"    "RPOC-RLOCid2"  "ROP3-LMTGtp"   "RT2-RP"       
: [17] "RSTGpd2-LFOC3" "LSPL-LIC3"     "LSC-RPT"       "LSC-LC2"      
: [21] "RFP8-RPG5"     "LLG2-LLOCsd2"  "RP2-LIC"       "LLG3-LSFG"    
: [25] "RTP3-LC"       "RTP3-LC2"      "LTOFC2-LPGpd"  "B-RPC"        
: [29] "B-RLOCsd2"     "LPT-LSC"


